app/controllers/resumes_controller.rb

  def index
    @resumes = Resume.all
---
SELECT "resumes".* FROM "resumes"

  def create
    @resume = Resume.new(resume_params)

    respond_to do |format|
      if @resume.save
---
INSERT INTO "resumes" ("created_at", "updated_at", "first_name", "last_name", "email", "address", "state", "city", "pincode", "country", "college_name", "college_address", "school_name_10th", "aggregate_mark_10th", "school_10th_address", "school_name_12th", "aggregate_mark_12th", "school_12th_address", "job_title", "company_name", "location", "salary", "from", "to", "hobbies_interest", "professional_skills", "languages") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @resume.update(resume_params)
---
UPDATE "resumes" SET "first_name" = ?, "last_name" = ?, "email" = ?, "address" = ?, "state" = ?, "city" = ?, "pincode" = ?, "country" = ?, "college_name" = ?, "college_address" = ?, "school_name_10th" = ?, "aggregate_mark_10th" = ?, "school_10th_address" = ?, "school_name_12th" = ?, "aggregate_mark_12th" = ?, "school_12th_address" = ?, "job_title" = ?, "company_name" = ?, "location" = ?, "salary" = ?, "from" = ?, "to" = ?, "hobbies_interest" = ?, "professional_skills" = ?, "languages" = ?, "updated_at" = ? WHERE "resumes"."id" = ?

  def destroy
    @resume.destroy
---
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 2]]

    def set_resume
      @resume = Resume.find(params[:id])
---
SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]